---
kind: property
id: P:Autodesk.Revit.DB.GBXMLExportOptions.ExportAnalyticalSystems
source: html/f28f66f7-8c0a-0037-dade-20452bfbca9a.htm
---
# Autodesk.Revit.DB.GBXMLExportOptions.ExportAnalyticalSystems Property

Indicates if the gbXML should contain analytical system elements (e.g., Water Loop, Air System, and Zone Equipment).

## Syntax (C#)
```csharp
public bool ExportAnalyticalSystems { get; set; }
```